MODEL 7:

SAME AS MODEL 4 BUT INSTEAD OF MONTHLY, THIS ONE SHOWS DAILY REVENUE

In [1]:
import duckdb

In [2]:
conn = duckdb.connect('c:/Users/Fgllc/OneDrive/Escritorio/USC/etl_project/cinema_tickets.duckdb')
conn

MODEL 7 QUERY:

In [3]:
query = """
SELECT 
    cinema_code,
    day,
    SUM(total_revenue_usd) AS daily_revenue
FROM master_model
GROUP BY cinema_code, day
ORDER by day, daily_revenue DESC
"""

conn.execute(query).fetch_df()

      cinema_code  day  daily_revenue
0             448    1     4089629.25
1             304    1     1931785.00
2             524    1     1221362.50
3             489    1     1199952.50
4             344    1     1106455.00
...           ...  ...            ...
7401          525   31         680.00
7402          465   31         540.00
7403          512   31         450.00
7404          215   31         350.00
7405          543   31         100.00

[7406 rows x 3 columns]

CHECKING IF MODEL RUNS:

In [4]:
conn.execute('SELECT * FROM seventh_model').fetch_df()

      cinema_code  day  daily_revenue
0             448    1     4089629.25
1             304    1     1931785.00
2             524    1     1221362.50
3             489    1     1199952.50
4             344    1     1106455.00
...           ...  ...            ...
7401          525   31         680.00
7402          465   31         540.00
7403          512   31         450.00
7404          215   31         350.00
7405          543   31         100.00

[7406 rows x 3 columns]

In [5]:
conn.close()